# ImportOptions3DM Constructor (ImportOptions3DM) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImportOptions3DM Constructor (ImportOptions3DM)
ImportOptions3DM Class See Also
---
Constructs a new instance of ImportOptions3DM as a copy of the provided import options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ImportOptions3DM(
	ImportOptions3DM option
)
```

Visual Basic
---
```text
Public Sub New ( _
	option As ImportOptions3DM _
)
```

Visual C++
---
```text
public:
ImportOptions3DM(
	ImportOptions3DM^ option
)
```

# ### Parameters
option
    Type: Autodesk.Revit.DB..::..ImportOptions3DM The 3DM import options to be copied.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ImportOptions3DM Class
ImportOptions3DM Overload
Autodesk.Revit.DB Namespace